# Let's learn Pandas by looking at simple Emp data

In [1]:
import pandas as pd

df = pd.read_csv('emp.db.csv',skiprows=4)

## Some useful information to start off

In [2]:
# the first n (5, by default) rows 
df.head(1)
# display the last n (5, by default) rows 
df.tail(1)
# column info - names, data type etc
df.info()
# column list
df.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        13 non-null     object
 1   basic       13 non-null     float64
 2   hra         13 non-null     float64
 3   da_percent  13 non-null     int64
 4   dept        13 non-null     object
 5   dob         13 non-null     object
 6   doj         13 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 856.0+ bytes

Index(['name', 'basic', 'hra', 'da_percent', 'dept', 'dob', 'doj'], dtype='object')

## Single column data (pandas series)

In [3]:
print(type(df['name']))
print(df['name'].head())

<class 'pandas.core.series.Series'>
0      Floop McMan
1    John Mohammed
2       Poker John
3    Hoop Ganjaopl
4     Merk Kepinam
Name: name, dtype: object

## Multi column data (dataframe)
Nice to graph data

In [4]:
print(type(df[['name','dob']]))
print(df[['name','dob']])

<class 'pandas.core.frame.DataFrame'>
             name         dob
0     Floop McMan   5/14/1973
1   John Mohammed    9/2/1972
2      Poker John   4/25/1998
3   Hoop Ganjaopl   5/22/1995
4    Merk Kepinam   3/28/1988
5    Pern Stapuga  11/13/1970
6    Jacob Burmin    5/6/1983
7    Brihat Makdo   4/10/1982
8    Brouni Sadip   5/27/1976
9    Jaspi Makdop   12/9/1985
10   Cheni Branti    4/8/1973
11     Dro Nupone   6/19/1977
12    Zepi Jaskip  10/21/1975

## iloc - integer location
* first arg - the rows you want
* second arg - the columns you want

### filter rows

In [5]:
# get first row
df.iloc[0]
# get first to third rows (slicing doesn't include last)
df.iloc[0:3]
# get second to last
df.iloc[1:]
# basically use slicing the way you would with python lists
# all that weird stuff like [-1:] et al
df.iloc[-1:]

           name     basic       hra  da_percent dept         dob        doj
12  Zepi Jaskip  56858.46  19336.46          84   HR  10/21/1975  5/22/2010

### filter rows & columns

In [6]:
# first row, first to third columns
df.iloc[0,1:4]
# all rows, first column
df.iloc[:,0]
# all rows, first to 4th columns (again non-inclusive last)
df.iloc[:,0:5]
# first 10 rows, first third and fifth columns (skip)
df.iloc[:10,1:6:2]

      basic  da_percent         dob
0  41124.18          80   5/14/1973
1  46211.32          71    9/2/1972
2  73181.69         100   4/25/1998
3  41044.48          62   5/22/1995
4  60954.38          93   3/28/1988
5  63689.49          69  11/13/1970
6  79791.61          99    5/6/1983
7  52062.62          84   4/10/1982
8  58422.94          87   5/27/1976
9  46887.73          64   12/9/1985

## iterate rows

In [7]:
for i, r in df.iloc[0:2].iterrows():
    print(r)    # each row is a series object

name          Floop McMan
basic             41124.2
hra               18566.5
da_percent             80
dept                  Fin
dob             5/14/1973
doj              6/3/2016
Name: 0, dtype: object
name          John Mohammed
basic               46211.3
hra                 10571.8
da_percent               71
dept                     IT
dob                9/2/1972
doj              11/13/2011
Name: 1, dtype: object

## loc - column name
(also referred to as Boolean indexing, I think)

**Note**: loc returns a dataframe. So, you can do other dataframe stuff on the output of loc

In [8]:
df.loc[df['dept'] == 'HR']

            name     basic       hra  da_percent dept         dob        doj
2     Poker John  73181.69  19710.86         100   HR   4/25/1998  3/19/2019
9   Jaspi Makdop  46887.73  16494.96          64   HR   12/9/1985  6/21/2016
10  Cheni Branti  64967.64  10611.87          68   HR    4/8/1973  8/28/2016
12   Zepi Jaskip  56858.46  19336.46          84   HR  10/21/1975  5/22/2010

## Get some overall stats about the dataframe

In [9]:
df.describe()

              basic           hra  da_percent
count     13.000000     13.000000   13.000000
mean   56782.439231  15857.836154   78.615385
std    11805.558744   3234.589019   13.763106
min    41044.480000  10571.810000   61.000000
25%    46887.730000  14373.730000   68.000000
50%    56858.460000  16494.960000   80.000000
75%    63689.490000  18566.530000   87.000000
max    79791.610000  19710.860000  100.000000

## Sorting

In [10]:
# single column
df.sort_values('name', ascending=False) ## ascending is optional
# multiple columns
df[df['dept']=='HR'].sort_values(['name','basic'], ascending=[False,True]) #descending on first (ascending=False); ascending on second (ascending=True)

            name     basic       hra  da_percent dept         dob        doj
12   Zepi Jaskip  56858.46  19336.46          84   HR  10/21/1975  5/22/2010
2     Poker John  73181.69  19710.86         100   HR   4/25/1998  3/19/2019
9   Jaspi Makdop  46887.73  16494.96          64   HR   12/9/1985  6/21/2016
10  Cheni Branti  64967.64  10611.87          68   HR    4/8/1973  8/28/2016

## Now some computed fields
basic_hra = basic + hra

In [11]:
# using iloc - first arg is number of ci
df['basic+hra'] = df.iloc[:,1:3].sum(axis=1)  #axix=0 y-axis

,name,basic,hra,basic+hra,da_percent,dept,dob,doj
0,Floop McMan,41124.18,18566.53,59690.71,80,Fin,5/14/1973,6/3/2016
1,John Mohammed,46211.32,10571.81,56783.13,71,IT,9/2/1972,11/13/2011
2,Poker John,73181.69,19710.86,92892.55,100,HR,4/25/1998,3/19/2019
3,Hoop Ganjaopl,41044.48,15979.12,57023.60,62,Engg.,5/22/1995,8/29/2017
4,Merk Kepinam,60954.38,17687.51,78641.89,93,IT,3/28/1988,6/27/2015
5,Pern Stapuga,63689.49,11535.77,75225.26,69,Engg.,11/13/1970,10/6/2012
6,Jacob Burmin,79791.61,17086.09,96877.70,99,Fin,5/6/1983,9/2/2011
7,Brihat Makdo,52062.62,15286.64,67349.26,84,Engg.,4/10/1982,8/3/2015
8,Brouni Sadip,58422.94,18910.52,77333.46,87,IT,5/27/1976,9/31/2012
9,Jaspi Makdop,46887.73,16494.96,63382.69,64,HR,12/9/1985,6/21/2016
10,Cheni Branti,64967.64,10611.87,75579.51,68,HR,4/8/1973,8/28/2016
11,Dro Nupone,52975.17,14373.73,67348.90,61,IT,6/19/1977,7/1/2018
12,Zepi Jaskip,56858.46,19336.46,76194.92,84,HR,10/21/1975,5/22/2010

## Reordering columns
You just create another df with columns in the specified order (a little tacky, I think)

In [15]:
# and then rearrange0 the cols to put basic+hra after the basic and hr cols
# first get the cols list
cols = list(df.columns.values)
df = df[cols[0:3] + cols[-1:] + cols[3:7]]
df

,name,basic,hra,doj,basic+hra,da_percent,dept,dob
0,Floop McMan,41124.18,18566.53,6/3/2016,59690.71,80,Fin,5/14/1973
1,John Mohammed,46211.32,10571.81,11/13/2011,56783.13,71,IT,9/2/1972
2,Poker John,73181.69,19710.86,3/19/2019,92892.55,100,HR,4/25/1998
3,Hoop Ganjaopl,41044.48,15979.12,8/29/2017,57023.60,62,Engg.,5/22/1995
4,Merk Kepinam,60954.38,17687.51,6/27/2015,78641.89,93,IT,3/28/1988
5,Pern Stapuga,63689.49,11535.77,10/6/2012,75225.26,69,Engg.,11/13/1970
6,Jacob Burmin,79791.61,17086.09,9/2/2011,96877.70,99,Fin,5/6/1983
7,Brihat Makdo,52062.62,15286.64,8/3/2015,67349.26,84,Engg.,4/10/1982
8,Brouni Sadip,58422.94,18910.52,9/31/2012,77333.46,87,IT,5/27/1976
9,Jaspi Makdop,46887.73,16494.96,6/21/2016,63382.69,64,HR,12/9/1985
10,Cheni Branti,64967.64,10611.87,8/28/2016,75579.51,68,HR,4/8/1973
11,Dro Nupone,52975.17,14373.73,7/1/2018,67348.90,61,IT,6/19/1977
12,Zepi Jaskip,56858.46,19336.46,5/22/2010,76194.92,84,HR,10/21/1975